package rv32i_pkg;

/*----------------------------------------------
    一、枚举定义，用于表示指令信息
----------------------------------------------*/

// opcode define

typedef enum logic [6:0] {
    OP_IMM  = 7'b0010011, 
    OP      = 7'b0110011, 
    LOAD    = 7'b0000011, 
    STORE   = 7'b0100011, 
    BRANCH  = 7'b1100011, 
    JAL     = 7'b1101111, 
    JALR    = 7'b1100111
} opcode_e ;

/*----------------------------------------------
    二、结构体定义，用于表示指令信息
----------------------------------------------*/


/*----------------------------------------------
    三、参数定义，用于表示指令信息
----------------------------------------------*/
parameter ADD_WIDTH     = 32;       // 地址宽度
parameter DATA_WIDTH    = 32;       // 数据宽度

endpackage